{
  "contact": {
    "name": "Adam Chaabane",
    "address": "921 Sloat Drive, Salinas, CA",
    "email": "adam@rdr-gp.com",
    "phone": "831-760-6958"
  },
  "summary": "Data Engineer and Full‑Stack Developer experienced in building secure, scalable systems for government and enterprise use. Strong in relational data modeling, API/microservices integration, and analytics with Power BI, Tableau, and Crystal Reports. Adept at turning complex requirements into intuitive UIs and automated, auditable data workflows aligned with GDPR/CCPA.",
  "jobs": [
    {
      "title": "Senior Data Engineer & Full-Stack Web Developer",
      "company": "RDR Group",
      "location": "Salinas, CA",
      "startDate": "June 2024",
      "endDate": "Current",
      "duties": [
        "Developed secure, scalable applications handling PII in alignment with GDPR and CCPA.",
        "Designed and optimized relational databases for performance, security, and integrity.",
        "Integrated APIs and microservices across on‑prem and cloud services with staged Excel export workflows for rapid analysis and prototyping.",
        "Built automated Excel data export/reporting pipelines for validation and client deliverables.",
        "Developed solutions with Python, JavaScript, and HTML; created dashboards in Power BI, Tableau, and SAP Crystal Reports.",
        "Gathered requirements with clients and delivered intuitive GUIs to improve efficiency.",
        "Collaborated cross‑functionally to deliver tailored solutions improving processes and adoption."
      ]
    },
    {
      "title": "Senior Departmental Information Systems Coordinator",
      "company": "Monterey County Probation Department",
      "location": "Salinas, CA",
      "startDate": "November 2023",
      "endDate": "June 2024",
      "duties": [
        "Administered on‑prem and cloud enterprise databases ensuring integrity and uptime.",
        "Created complex SQL for reporting and compliance across Adult and Juvenile Divisions.",
        "Built Power BI dashboards to surface real‑time KPIs and improve visibility.",
        "Supported and trained users on critical systems including institutional control systems and contingency procedures.",
        "Maintained and integrated on‑prem and SaaS platforms for forms, storage, and retrieval.",
        "Coordinated upgrades with IT and business teams; resolved technical issues and optimized performance.",
        "Led analysts, authored technical requirements, and implemented process improvements."
      ]
    },
    {
      "title": "SCADA Systems Programmer",
      "company": "CalScada",
      "location": "Salinas, CA",
      "startDate": "September 2019",
      "endDate": "February 2021",
      "duties": [
        "Designed and implemented SCADA systems for water treatment operations automation.",
        "Integrated SCADA data with relational databases for real‑time insights and reporting.",
        "Automated processing using Python and SQL to reduce manual tasks.",
        "Partnered with engineering to deliver custom solutions on time.",
        "Developed client‑facing reports and dashboards for real‑time metrics.",
        "Produced technical documentation and user manuals to streamline training and support."
      ]
    },
    {
      "title": "Supervisory Control and Data Acquisition (SCADA) Technician",
      "company": "ALCO Water Services",
      "location": "Salinas, CA",
      "startDate": "May 2018",
      "endDate": "June 2019",
      "duties": [
        "Programmed and installed SCADA systems to improve real‑time data collection.",
        "Automated SCADA‑to‑database integrations and streamlined reporting.",
        "Managed multiple SCADA projects to meet specifications and deadlines.",
        "Created technical documentation and user guides for operations and maintenance."
      ]
    }
  ],
  "skills": {
    "Data Engineering": [
      "Relational Data Modeling",
      "ETL/ELT Pipelines",
      "SQL Performance Tuning",
      "Data Governance (GDPR/CCPA)"
    ],
    "Programming": [
      "Python",
      "JavaScript",
      "HTML/CSS",
      "REST APIs",
      "Microservices"
    ],
    "Analytics & BI": [
      "Power BI",
      "Tableau",
      "SAP Crystal Reports",
      "Excel Automation"
    ],
    "DevOps & Platforms": [
      "On‑prem and Cloud Integrations",
      "Version Control (Git)"
    ],
    "SCADA & Industrial": [
      "SCADA Integrations",
      "Realtime Data Acquisition"
    ],
    "Soft Skills": [
      "Client Requirements Gathering",
      "Cross‑functional Collaboration",
      "Technical Documentation",
      "Training & Support"
    ]
  },
  "education": [
    "B.S. in Computer Science, University of California, Santa Cruz (May 2024)"
  ],
  "certificates": [
    "University of Santa Cruz B.S. Degree in Computer Science (certified graduation date May 2024)",
    "California Law Enforcement Telecommunications System (CLETS) Certification",
    "CRYSTAL REPORTS for SAP BUSINESS ONE MASTERY (Udemy)",
    "SQL QUERY FOR SAP BUSINESS ONE (Udemy)",
    "Water Distributor Operator Grade 2 Certification",
    "Water Treatment Operator Grade 2 Certification"
  ]
}